Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00-S1/include/component/tamper.h
#define TAMPER_LEVELB_LEVEL8_Pos              _UINT32_(0)                                          /* (TAMPER_LEVELB) Level 8 Position */
#define TAMPER_LEVELB_LEVEL8_Msk              (_UINT32_(0xF) << TAMPER_LEVELB_LEVEL8_Pos)          /* (TAMPER_LEVELB) Level 8 Mask */
#define TAMPER_LEVELB_LEVEL8(value)           (TAMPER_LEVELB_LEVEL8_Msk & (_UINT32_(value) << TAMPER_LEVELB_LEVEL8_Pos)) /* Assigment of value for LEVEL8 in the TAMPER_LEVELB register */
#define   TAMPER_LEVELB_LEVEL8_NONE_Val       _UINT32_(0x0)                                        /* (TAMPER_LEVELB) No Action  */
#define   TAMPER_LEVELB_LEVEL8_HOSTIRQ_Val    _UINT32_(0x1)                                        /* (TAMPER_LEVELB) Host Interrupt  */
#define   TAMPER_LEVELB_LEVEL8_LEHIRQ_Val     _UINT32_(0x2)                                        /* (TAMPER_LEVELB) Log Event and Host Interrupt  */
#define   TAMPER_LEVELB_LEVEL8_SAFEMODE_Val   _UINT32_(0x4)                                        /* (TAMPER_LEVELB) Enter Safe Mode  */
#define   TAMPER_LEVELB_LEVEL8_ERSTKEY_Val    _UINT32_(0x5)                                        /* (TAMPER_LEVELB) Erase Tamper Key  */
#define   TAMPER_LEVELB_LEVEL8_ERSFKEY_Val    _UINT32_(0x6)                                        /* (TAMPER_LEVELB) Erase Flash Key  */
#define TAMPER_LEVELB_LEVEL8_NONE             (TAMPER_LEVELB_LEVEL8_NONE_Val << TAMPER_LEVELB_LEVEL8_Pos) /* (TAMPER_LEVELB) No Action Position  */
#define TAMPER_LEVELB_LEVEL8_HOSTIRQ          (TAMPER_LEVELB_LEVEL8_HOSTIRQ_Val << TAMPER_LEVELB_LEVEL8_Pos) /* (TAMPER_LEVELB) Host Interrupt Position  */
#define TAMPER_LEVELB_LEVEL8_LEHIRQ           (TAMPER_LEVELB_LEVEL8_LEHIRQ_Val << TAMPER_LEVELB_LEVEL8_Pos) /* (TAMPER_LEVELB) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELB_LEVEL8_SAFEMODE         (TAMPER_LEVELB_LEVEL8_SAFEMODE_Val << TAMPER_LEVELB_LEVEL8_Pos) /* (TAMPER_LEVELB) Enter Safe Mode Position  */
#define TAMPER_LEVELB_LEVEL8_ERSTKEY          (TAMPER_LEVELB_LEVEL8_ERSTKEY_Val << TAMPER_LEVELB_LEVEL8_Pos) /* (TAMPER_LEVELB) Erase Tamper Key Position  */
#define TAMPER_LEVELB_LEVEL8_ERSFKEY          (TAMPER_LEVELB_LEVEL8_ERSFKEY_Val << TAMPER_LEVELB_LEVEL8_Pos) /* (TAMPER_LEVELB) Erase Flash Key Position  */
#define TAMPER_LEVELB_LEVEL9_Pos              _UINT32_(4)                                          /* (TAMPER_LEVELB) Level 9 Position */
#define TAMPER_LEVELB_LEVEL9_Msk              (_UINT32_(0xF) << TAMPER_LEVELB_LEVEL9_Pos)          /* (TAMPER_LEVELB) Level 9 Mask */
#define TAMPER_LEVELB_LEVEL9(value)           (TAMPER_LEVELB_LEVEL9_Msk & (_UINT32_(value) << TAMPER_LEVELB_LEVEL9_Pos)) /* Assigment of value for LEVEL9 in the TAMPER_LEVELB register */
#define   TAMPER_LEVELB_LEVEL9_NONE_Val       _UINT32_(0x0)                                        /* (TAMPER_LEVELB) No Action  */
#define   TAMPER_LEVELB_LEVEL9_HOSTIRQ_Val    _UINT32_(0x1)                                        /* (TAMPER_LEVELB) Host Interrupt  */
#define   TAMPER_LEVELB_LEVEL9_LEHIRQ_Val     _UINT32_(0x2)                                        /* (TAMPER_LEVELB) Log Event and Host Interrupt  */
#define   TAMPER_LEVELB_LEVEL9_SAFEMODE_Val   _UINT32_(0x4)                                        /* (TAMPER_LEVELB) Enter Safe Mode  */
#define   TAMPER_LEVELB_LEVEL9_ERSTKEY_Val    _UINT32_(0x5)                                        /* (TAMPER_LEVELB) Erase Tamper Key  */
#define   TAMPER_LEVELB_LEVEL9_ERSFKEY_Val    _UINT32_(0x6)                                        /* (TAMPER_LEVELB) Erase Flash Key  */
#define TAMPER_LEVELB_LEVEL9_NONE             (TAMPER_LEVELB_LEVEL9_NONE_Val << TAMPER_LEVELB_LEVEL9_Pos) /* (TAMPER_LEVELB) No Action Position  */
#define TAMPER_LEVELB_LEVEL9_HOSTIRQ          (TAMPER_LEVELB_LEVEL9_HOSTIRQ_Val << TAMPER_LEVELB_LEVEL9_Pos) /* (TAMPER_LEVELB) Host Interrupt Position  */
#define TAMPER_LEVELB_LEVEL9_LEHIRQ           (TAMPER_LEVELB_LEVEL9_LEHIRQ_Val << TAMPER_LEVELB_LEVEL9_Pos) /* (TAMPER_LEVELB) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELB_LEVEL9_SAFEMODE         (TAMPER_LEVELB_LEVEL9_SAFEMODE_Val << TAMPER_LEVELB_LEVEL9_Pos) /* (TAMPER_LEVELB) Enter Safe Mode Position  */
#define TAMPER_LEVELB_LEVEL9_ERSTKEY          (TAMPER_LEVELB_LEVEL9_ERSTKEY_Val << TAMPER_LEVELB_LEVEL9_Pos) /* (TAMPER_LEVELB) Erase Tamper Key Position  */
#define TAMPER_LEVELB_LEVEL9_ERSFKEY          (TAMPER_LEVELB_LEVEL9_ERSFKEY_Val << TAMPER_LEVELB_LEVEL9_Pos) /* (TAMPER_LEVELB) Erase Flash Key Position  */
#define TAMPER_LEVELB_LEVEL10_Pos             _UINT32_(8)                                          /* (TAMPER_LEVELB) Level 10 Position */
#define TAMPER_LEVELB_LEVEL10_Msk             (_UINT32_(0xF) << TAMPER_LEVELB_LEVEL10_Pos)         /* (TAMPER_LEVELB) Level 10 Mask */
#define TAMPER_LEVELB_LEVEL10(value)          (TAMPER_LEVELB_LEVEL10_Msk & (_UINT32_(value) << TAMPER_LEVELB_LEVEL10_Pos)) /* Assigment of value for LEVEL10 in the TAMPER_LEVELB register */
#define   TAMPER_LEVELB_LEVEL10_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELB) No Action  */
#define   TAMPER_LEVELB_LEVEL10_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELB) Host Interrupt  */
#define   TAMPER_LEVELB_LEVEL10_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELB) Log Event and Host Interrupt  */
#define   TAMPER_LEVELB_LEVEL10_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELB) Enter Safe Mode  */
#define   TAMPER_LEVELB_LEVEL10_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELB) Erase Tamper Key  */
#define   TAMPER_LEVELB_LEVEL10_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELB) Erase Flash Key  */
#define TAMPER_LEVELB_LEVEL10_NONE            (TAMPER_LEVELB_LEVEL10_NONE_Val << TAMPER_LEVELB_LEVEL10_Pos) /* (TAMPER_LEVELB) No Action Position  */
#define TAMPER_LEVELB_LEVEL10_HOSTIRQ         (TAMPER_LEVELB_LEVEL10_HOSTIRQ_Val << TAMPER_LEVELB_LEVEL10_Pos) /* (TAMPER_LEVELB) Host Interrupt Position  */
#define TAMPER_LEVELB_LEVEL10_LEHIRQ          (TAMPER_LEVELB_LEVEL10_LEHIRQ_Val << TAMPER_LEVELB_LEVEL10_Pos) /* (TAMPER_LEVELB) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELB_LEVEL10_SAFEMODE        (TAMPER_LEVELB_LEVEL10_SAFEMODE_Val << TAMPER_LEVELB_LEVEL10_Pos) /* (TAMPER_LEVELB) Enter Safe Mode Position  */
#define TAMPER_LEVELB_LEVEL10_ERSTKEY         (TAMPER_LEVELB_LEVEL10_ERSTKEY_Val << TAMPER_LEVELB_LEVEL10_Pos) /* (TAMPER_LEVELB) Erase Tamper Key Position  */
#define TAMPER_LEVELB_LEVEL10_ERSFKEY         (TAMPER_LEVELB_LEVEL10_ERSFKEY_Val << TAMPER_LEVELB_LEVEL10_Pos) /* (TAMPER_LEVELB) Erase Flash Key Position  */
#define TAMPER_LEVELB_LEVEL11_Pos             _UINT32_(12)                                         /* (TAMPER_LEVELB) Level 11 Position */
#define TAMPER_LEVELB_LEVEL11_Msk             (_UINT32_(0xF) << TAMPER_LEVELB_LEVEL11_Pos)         /* (TAMPER_LEVELB) Level 11 Mask */
#define TAMPER_LEVELB_LEVEL11(value)          (TAMPER_LEVELB_LEVEL11_Msk & (_UINT32_(value) << TAMPER_LEVELB_LEVEL11_Pos)) /* Assigment of value for LEVEL11 in the TAMPER_LEVELB register */
#define   TAMPER_LEVELB_LEVEL11_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELB) No Action  */
#define   TAMPER_LEVELB_LEVEL11_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELB) Host Interrupt  */
#define   TAMPER_LEVELB_LEVEL11_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELB) Log Event and Host Interrupt  */
#define   TAMPER_LEVELB_LEVEL11_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELB) Enter Safe Mode  */
#define   TAMPER_LEVELB_LEVEL11_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELB) Erase Tamper Key  */
#define   TAMPER_LEVELB_LEVEL11_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELB) Erase Flash Key  */
#define TAMPER_LEVELB_LEVEL11_NONE            (TAMPER_LEVELB_LEVEL11_NONE_Val << TAMPER_LEVELB_LEVEL11_Pos) /* (TAMPER_LEVELB) No Action Position  */
#define TAMPER_LEVELB_LEVEL11_HOSTIRQ         (TAMPER_LEVELB_LEVEL11_HOSTIRQ_Val << TAMPER_LEVELB_LEVEL11_Pos) /* (TAMPER_LEVELB) Host Interrupt Position  */
#define TAMPER_LEVELB_LEVEL11_LEHIRQ          (TAMPER_LEVELB_LEVEL11_LEHIRQ_Val << TAMPER_LEVELB_LEVEL11_Pos) /* (TAMPER_LEVELB) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELB_LEVEL11_SAFEMODE        (TAMPER_LEVELB_LEVEL11_SAFEMODE_Val << TAMPER_LEVELB_LEVEL11_Pos) /* (TAMPER_LEVELB) Enter Safe Mode Position  */
#define TAMPER_LEVELB_LEVEL11_ERSTKEY         (TAMPER_LEVELB_LEVEL11_ERSTKEY_Val << TAMPER_LEVELB_LEVEL11_Pos) /* (TAMPER_LEVELB) Erase Tamper Key Position  */
#define TAMPER_LEVELB_LEVEL11_ERSFKEY         (TAMPER_LEVELB_LEVEL11_ERSFKEY_Val << TAMPER_LEVELB_LEVEL11_Pos) /* (TAMPER_LEVELB) Erase Flash Key Position  */
#define TAMPER_LEVELB_LEVEL12_Pos             _UINT32_(16)                                         /* (TAMPER_LEVELB) Level 12 Position */
#define TAMPER_LEVELB_LEVEL12_Msk             (_UINT32_(0xF) << TAMPER_LEVELB_LEVEL12_Pos)         /* (TAMPER_LEVELB) Level 12 Mask */
#define TAMPER_LEVELB_LEVEL12(value)          (TAMPER_LEVELB_LEVEL12_Msk & (_UINT32_(value) << TAMPER_LEVELB_LEVEL12_Pos)) /* Assigment of value for LEVEL12 in the TAMPER_LEVELB register */
#define   TAMPER_LEVELB_LEVEL12_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELB) No Action  */
#define   TAMPER_LEVELB_LEVEL12_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELB) Host Interrupt  */
#define   TAMPER_LEVELB_LEVEL12_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELB) Log Event and Host Interrupt  */
#define   TAMPER_LEVELB_LEVEL12_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELB) Enter Safe Mode  */
#define   TAMPER_LEVELB_LEVEL12_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELB) Erase Tamper Key  */
#define   TAMPER_LEVELB_LEVEL12_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELB) Erase Flash Key  */
#define TAMPER_LEVELB_LEVEL12_NONE            (TAMPER_LEVELB_LEVEL12_NONE_Val << TAMPER_LEVELB_LEVEL12_Pos) /* (TAMPER_LEVELB) No Action Position  */
#define TAMPER_LEVELB_LEVEL12_HOSTIRQ         (TAMPER_LEVELB_LEVEL12_HOSTIRQ_Val << TAMPER_LEVELB_LEVEL12_Pos) /* (TAMPER_LEVELB) Host Interrupt Position  */
#define TAMPER_LEVELB_LEVEL12_LEHIRQ          (TAMPER_LEVELB_LEVEL12_LEHIRQ_Val << TAMPER_LEVELB_LEVEL12_Pos) /* (TAMPER_LEVELB) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELB_LEVEL12_SAFEMODE        (TAMPER_LEVELB_LEVEL12_SAFEMODE_Val << TAMPER_LEVELB_LEVEL12_Pos) /* (TAMPER_LEVELB) Enter Safe Mode Position  */
#define TAMPER_LEVELB_LEVEL12_ERSTKEY         (TAMPER_LEVELB_LEVEL12_ERSTKEY_Val << TAMPER_LEVELB_LEVEL12_Pos) /* (TAMPER_LEVELB) Erase Tamper Key Position  */
#define TAMPER_LEVELB_LEVEL12_ERSFKEY         (TAMPER_LEVELB_LEVEL12_ERSFKEY_Val << TAMPER_LEVELB_LEVEL12_Pos) /* (TAMPER_LEVELB) Erase Flash Key Position  */
#define TAMPER_LEVELB_LEVEL13_Pos             _UINT32_(20)                                         /* (TAMPER_LEVELB) Level 13 Position */
#define TAMPER_LEVELB_LEVEL13_Msk             (_UINT32_(0xF) << TAMPER_LEVELB_LEVEL13_Pos)         /* (TAMPER_LEVELB) Level 13 Mask */
#define TAMPER_LEVELB_LEVEL13(value)          (TAMPER_LEVELB_LEVEL13_Msk & (_UINT32_(value) << TAMPER_LEVELB_LEVEL13_Pos)) /* Assigment of value for LEVEL13 in the TAMPER_LEVELB register */
#define   TAMPER_LEVELB_LEVEL13_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELB) No Action  */
#define   TAMPER_LEVELB_LEVEL13_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELB) Host Interrupt  */
#define   TAMPER_LEVELB_LEVEL13_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELB) Log Event and Host Interrupt  */
#define   TAMPER_LEVELB_LEVEL13_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELB) Enter Safe Mode  */
#define   TAMPER_LEVELB_LEVEL13_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELB) Erase Tamper Key  */
#define   TAMPER_LEVELB_LEVEL13_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELB) Erase Flash Key  */
#define TAMPER_LEVELB_LEVEL13_NONE            (TAMPER_LEVELB_LEVEL13_NONE_Val << TAMPER_LEVELB_LEVEL13_Pos) /* (TAMPER_LEVELB) No Action Position  */
#define TAMPER_LEVELB_LEVEL13_HOSTIRQ         (TAMPER_LEVELB_LEVEL13_HOSTIRQ_Val << TAMPER_LEVELB_LEVEL13_Pos) /* (TAMPER_LEVELB) Host Interrupt Position  */
#define TAMPER_LEVELB_LEVEL13_LEHIRQ          (TAMPER_LEVELB_LEVEL13_LEHIRQ_Val << TAMPER_LEVELB_LEVEL13_Pos) /* (TAMPER_LEVELB) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELB_LEVEL13_SAFEMODE        (TAMPER_LEVELB_LEVEL13_SAFEMODE_Val << TAMPER_LEVELB_LEVEL13_Pos) /* (TAMPER_LEVELB) Enter Safe Mode Position  */
#define TAMPER_LEVELB_LEVEL13_ERSTKEY         (TAMPER_LEVELB_LEVEL13_ERSTKEY_Val << TAMPER_LEVELB_LEVEL13_Pos) /* (TAMPER_LEVELB) Erase Tamper Key Position  */
#define TAMPER_LEVELB_LEVEL13_ERSFKEY         (TAMPER_LEVELB_LEVEL13_ERSFKEY_Val << TAMPER_LEVELB_LEVEL13_Pos) /* (TAMPER_LEVELB) Erase Flash Key Position  */
#define TAMPER_LEVELB_LEVEL14_Pos             _UINT32_(24)                                         /* (TAMPER_LEVELB) Level 14 Position */
#define TAMPER_LEVELB_LEVEL14_Msk             (_UINT32_(0xF) << TAMPER_LEVELB_LEVEL14_Pos)         /* (TAMPER_LEVELB) Level 14 Mask */
#define TAMPER_LEVELB_LEVEL14(value)          (TAMPER_LEVELB_LEVEL14_Msk & (_UINT32_(value) << TAMPER_LEVELB_LEVEL14_Pos)) /* Assigment of value for LEVEL14 in the TAMPER_LEVELB register */
#define   TAMPER_LEVELB_LEVEL14_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELB) No Action  */
#define   TAMPER_LEVELB_LEVEL14_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELB) Host Interrupt  */
#define   TAMPER_LEVELB_LEVEL14_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELB) Log Event and Host Interrupt  */
#define   TAMPER_LEVELB_LEVEL14_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELB) Enter Safe Mode  */
#define   TAMPER_LEVELB_LEVEL14_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELB) Erase Tamper Key  */
#define   TAMPER_LEVELB_LEVEL14_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELB) Erase Flash Key  */
#define TAMPER_LEVELB_LEVEL14_NONE            (TAMPER_LEVELB_LEVEL14_NONE_Val << TAMPER_LEVELB_LEVEL14_Pos) /* (TAMPER_LEVELB) No Action Position  */
#define TAMPER_LEVELB_LEVEL14_HOSTIRQ         (TAMPER_LEVELB_LEVEL14_HOSTIRQ_Val << TAMPER_LEVELB_LEVEL14_Pos) /* (TAMPER_LEVELB) Host Interrupt Position  */
#define TAMPER_LEVELB_LEVEL14_LEHIRQ          (TAMPER_LEVELB_LEVEL14_LEHIRQ_Val << TAMPER_LEVELB_LEVEL14_Pos) /* (TAMPER_LEVELB) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELB_LEVEL14_SAFEMODE        (TAMPER_LEVELB_LEVEL14_SAFEMODE_Val << TAMPER_LEVELB_LEVEL14_Pos) /* (TAMPER_LEVELB) Enter Safe Mode Position  */
#define TAMPER_LEVELB_LEVEL14_ERSTKEY         (TAMPER_LEVELB_LEVEL14_ERSTKEY_Val << TAMPER_LEVELB_LEVEL14_Pos) /* (TAMPER_LEVELB) Erase Tamper Key Position  */
#define TAMPER_LEVELB_LEVEL14_ERSFKEY         (TAMPER_LEVELB_LEVEL14_ERSFKEY_Val << TAMPER_LEVELB_LEVEL14_Pos) /* (TAMPER_LEVELB) Erase Flash Key Position  */
#define TAMPER_LEVELB_LEVEL15_Pos             _UINT32_(28)                                         /* (TAMPER_LEVELB) Level 15 Position */
#define TAMPER_LEVELB_LEVEL15_Msk             (_UINT32_(0xF) << TAMPER_LEVELB_LEVEL15_Pos)         /* (TAMPER_LEVELB) Level 15 Mask */
#define TAMPER_LEVELB_LEVEL15(value)          (TAMPER_LEVELB_LEVEL15_Msk & (_UINT32_(value) << TAMPER_LEVELB_LEVEL15_Pos)) /* Assigment of value for LEVEL15 in the TAMPER_LEVELB register */
#define   TAMPER_LEVELB_LEVEL15_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELB) No Action  */
#define   TAMPER_LEVELB_LEVEL15_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELB) Host Interrupt  */
#define   TAMPER_LEVELB_LEVEL15_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELB) Log Event and Host Interrupt  */
#define   TAMPER_LEVELB_LEVEL15_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELB) Enter Safe Mode  */
#define   TAMPER_LEVELB_LEVEL15_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELB) Erase Tamper Key  */
#define   TAMPER_LEVELB_LEVEL15_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELB) Erase Flash Key  */
#define TAMPER_LEVELB_LEVEL15_NONE            (TAMPER_LEVELB_LEVEL15_NONE_Val << TAMPER_LEVELB_LEVEL15_Pos) /* (TAMPER_LEVELB) No Action Position  */
#define TAMPER_LEVELB_LEVEL15_HOSTIRQ         (TAMPER_LEVELB_LEVEL15_HOSTIRQ_Val << TAMPER_LEVELB_LEVEL15_Pos) /* (TAMPER_LEVELB) Host Interrupt Position  */
#define TAMPER_LEVELB_LEVEL15_LEHIRQ          (TAMPER_LEVELB_LEVEL15_LEHIRQ_Val << TAMPER_LEVELB_LEVEL15_Pos) /* (TAMPER_LEVELB) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELB_LEVEL15_SAFEMODE        (TAMPER_LEVELB_LEVEL15_SAFEMODE_Val << TAMPER_LEVELB_LEVEL15_Pos) /* (TAMPER_LEVELB) Enter Safe Mode Position  */
#define TAMPER_LEVELB_LEVEL15_ERSTKEY         (TAMPER_LEVELB_LEVEL15_ERSTKEY_Val << TAMPER_LEVELB_LEVEL15_Pos) /* (TAMPER_LEVELB) Erase Tamper Key Position  */
#define TAMPER_LEVELB_LEVEL15_ERSFKEY         (TAMPER_LEVELB_LEVEL15_ERSFKEY_Val << TAMPER_LEVELB_LEVEL15_Pos) /* (TAMPER_LEVELB) Erase Flash Key Position  */
#define TAMPER_LEVELB_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (TAMPER_LEVELB) Register Mask  */


/* -------- TAMPER_LEVELC : (TAMPER Offset: 0x08) ( R/ 32) Level C -------- */
#define TAMPER_LEVELC_RESETVALUE              _UINT32_(0x11111111)                                 /*  (TAMPER_LEVELC) Level C  Reset Value */

