Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00-S1/include/component/tamper.h
/* -------- TAMPER_LEVELD : (TAMPER Offset: 0x0C) ( R/ 32) Level D -------- */
#define TAMPER_LEVELD_RESETVALUE              _UINT32_(0x11111111)                                 /*  (TAMPER_LEVELD) Level D  Reset Value */

#define TAMPER_LEVELD_LEVEL24_Pos             _UINT32_(0)                                          /* (TAMPER_LEVELD) Level 24 Position */
#define TAMPER_LEVELD_LEVEL24_Msk             (_UINT32_(0xF) << TAMPER_LEVELD_LEVEL24_Pos)         /* (TAMPER_LEVELD) Level 24 Mask */
#define TAMPER_LEVELD_LEVEL24(value)          (TAMPER_LEVELD_LEVEL24_Msk & (_UINT32_(value) << TAMPER_LEVELD_LEVEL24_Pos)) /* Assigment of value for LEVEL24 in the TAMPER_LEVELD register */
#define   TAMPER_LEVELD_LEVEL24_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELD) No Action  */
#define   TAMPER_LEVELD_LEVEL24_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELD) Host Interrupt  */
#define   TAMPER_LEVELD_LEVEL24_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELD) Log Event and Host Interrupt  */
#define   TAMPER_LEVELD_LEVEL24_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELD) Enter Safe Mode  */
#define   TAMPER_LEVELD_LEVEL24_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELD) Erase Tamper Key  */
#define   TAMPER_LEVELD_LEVEL24_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELD) Erase Flash Key  */
#define TAMPER_LEVELD_LEVEL24_NONE            (TAMPER_LEVELD_LEVEL24_NONE_Val << TAMPER_LEVELD_LEVEL24_Pos) /* (TAMPER_LEVELD) No Action Position  */
#define TAMPER_LEVELD_LEVEL24_HOSTIRQ         (TAMPER_LEVELD_LEVEL24_HOSTIRQ_Val << TAMPER_LEVELD_LEVEL24_Pos) /* (TAMPER_LEVELD) Host Interrupt Position  */
#define TAMPER_LEVELD_LEVEL24_LEHIRQ          (TAMPER_LEVELD_LEVEL24_LEHIRQ_Val << TAMPER_LEVELD_LEVEL24_Pos) /* (TAMPER_LEVELD) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELD_LEVEL24_SAFEMODE        (TAMPER_LEVELD_LEVEL24_SAFEMODE_Val << TAMPER_LEVELD_LEVEL24_Pos) /* (TAMPER_LEVELD) Enter Safe Mode Position  */
#define TAMPER_LEVELD_LEVEL24_ERSTKEY         (TAMPER_LEVELD_LEVEL24_ERSTKEY_Val << TAMPER_LEVELD_LEVEL24_Pos) /* (TAMPER_LEVELD) Erase Tamper Key Position  */
#define TAMPER_LEVELD_LEVEL24_ERSFKEY         (TAMPER_LEVELD_LEVEL24_ERSFKEY_Val << TAMPER_LEVELD_LEVEL24_Pos) /* (TAMPER_LEVELD) Erase Flash Key Position  */
#define TAMPER_LEVELD_LEVEL25_Pos             _UINT32_(4)                                          /* (TAMPER_LEVELD) Level 25 Position */
#define TAMPER_LEVELD_LEVEL25_Msk             (_UINT32_(0xF) << TAMPER_LEVELD_LEVEL25_Pos)         /* (TAMPER_LEVELD) Level 25 Mask */
#define TAMPER_LEVELD_LEVEL25(value)          (TAMPER_LEVELD_LEVEL25_Msk & (_UINT32_(value) << TAMPER_LEVELD_LEVEL25_Pos)) /* Assigment of value for LEVEL25 in the TAMPER_LEVELD register */
#define   TAMPER_LEVELD_LEVEL25_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELD) No Action  */
#define   TAMPER_LEVELD_LEVEL25_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELD) Host Interrupt  */
#define   TAMPER_LEVELD_LEVEL25_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELD) Log Event and Host Interrupt  */
#define   TAMPER_LEVELD_LEVEL25_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELD) Enter Safe Mode  */
#define   TAMPER_LEVELD_LEVEL25_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELD) Erase Tamper Key  */
#define   TAMPER_LEVELD_LEVEL25_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELD) Erase Flash Key  */
#define TAMPER_LEVELD_LEVEL25_NONE            (TAMPER_LEVELD_LEVEL25_NONE_Val << TAMPER_LEVELD_LEVEL25_Pos) /* (TAMPER_LEVELD) No Action Position  */
#define TAMPER_LEVELD_LEVEL25_HOSTIRQ         (TAMPER_LEVELD_LEVEL25_HOSTIRQ_Val << TAMPER_LEVELD_LEVEL25_Pos) /* (TAMPER_LEVELD) Host Interrupt Position  */
#define TAMPER_LEVELD_LEVEL25_LEHIRQ          (TAMPER_LEVELD_LEVEL25_LEHIRQ_Val << TAMPER_LEVELD_LEVEL25_Pos) /* (TAMPER_LEVELD) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELD_LEVEL25_SAFEMODE        (TAMPER_LEVELD_LEVEL25_SAFEMODE_Val << TAMPER_LEVELD_LEVEL25_Pos) /* (TAMPER_LEVELD) Enter Safe Mode Position  */
#define TAMPER_LEVELD_LEVEL25_ERSTKEY         (TAMPER_LEVELD_LEVEL25_ERSTKEY_Val << TAMPER_LEVELD_LEVEL25_Pos) /* (TAMPER_LEVELD) Erase Tamper Key Position  */
#define TAMPER_LEVELD_LEVEL25_ERSFKEY         (TAMPER_LEVELD_LEVEL25_ERSFKEY_Val << TAMPER_LEVELD_LEVEL25_Pos) /* (TAMPER_LEVELD) Erase Flash Key Position  */
#define TAMPER_LEVELD_LEVEL26_Pos             _UINT32_(8)                                          /* (TAMPER_LEVELD) Level 26 Position */
#define TAMPER_LEVELD_LEVEL26_Msk             (_UINT32_(0xF) << TAMPER_LEVELD_LEVEL26_Pos)         /* (TAMPER_LEVELD) Level 26 Mask */
#define TAMPER_LEVELD_LEVEL26(value)          (TAMPER_LEVELD_LEVEL26_Msk & (_UINT32_(value) << TAMPER_LEVELD_LEVEL26_Pos)) /* Assigment of value for LEVEL26 in the TAMPER_LEVELD register */
#define   TAMPER_LEVELD_LEVEL26_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELD) No Action  */
#define   TAMPER_LEVELD_LEVEL26_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELD) Host Interrupt  */
#define   TAMPER_LEVELD_LEVEL26_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELD) Log Event and Host Interrupt  */
#define   TAMPER_LEVELD_LEVEL26_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELD) Enter Safe Mode  */
#define   TAMPER_LEVELD_LEVEL26_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELD) Erase Tamper Key  */
#define   TAMPER_LEVELD_LEVEL26_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELD) Erase Flash Key  */
#define TAMPER_LEVELD_LEVEL26_NONE            (TAMPER_LEVELD_LEVEL26_NONE_Val << TAMPER_LEVELD_LEVEL26_Pos) /* (TAMPER_LEVELD) No Action Position  */
#define TAMPER_LEVELD_LEVEL26_HOSTIRQ         (TAMPER_LEVELD_LEVEL26_HOSTIRQ_Val << TAMPER_LEVELD_LEVEL26_Pos) /* (TAMPER_LEVELD) Host Interrupt Position  */
#define TAMPER_LEVELD_LEVEL26_LEHIRQ          (TAMPER_LEVELD_LEVEL26_LEHIRQ_Val << TAMPER_LEVELD_LEVEL26_Pos) /* (TAMPER_LEVELD) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELD_LEVEL26_SAFEMODE        (TAMPER_LEVELD_LEVEL26_SAFEMODE_Val << TAMPER_LEVELD_LEVEL26_Pos) /* (TAMPER_LEVELD) Enter Safe Mode Position  */
#define TAMPER_LEVELD_LEVEL26_ERSTKEY         (TAMPER_LEVELD_LEVEL26_ERSTKEY_Val << TAMPER_LEVELD_LEVEL26_Pos) /* (TAMPER_LEVELD) Erase Tamper Key Position  */
#define TAMPER_LEVELD_LEVEL26_ERSFKEY         (TAMPER_LEVELD_LEVEL26_ERSFKEY_Val << TAMPER_LEVELD_LEVEL26_Pos) /* (TAMPER_LEVELD) Erase Flash Key Position  */
#define TAMPER_LEVELD_LEVEL27_Pos             _UINT32_(12)                                         /* (TAMPER_LEVELD) Level 27 Position */
#define TAMPER_LEVELD_LEVEL27_Msk             (_UINT32_(0xF) << TAMPER_LEVELD_LEVEL27_Pos)         /* (TAMPER_LEVELD) Level 27 Mask */
#define TAMPER_LEVELD_LEVEL27(value)          (TAMPER_LEVELD_LEVEL27_Msk & (_UINT32_(value) << TAMPER_LEVELD_LEVEL27_Pos)) /* Assigment of value for LEVEL27 in the TAMPER_LEVELD register */
#define   TAMPER_LEVELD_LEVEL27_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELD) No Action  */
#define   TAMPER_LEVELD_LEVEL27_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELD) Host Interrupt  */
#define   TAMPER_LEVELD_LEVEL27_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELD) Log Event and Host Interrupt  */
#define   TAMPER_LEVELD_LEVEL27_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELD) Enter Safe Mode  */
#define   TAMPER_LEVELD_LEVEL27_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELD) Erase Tamper Key  */
#define   TAMPER_LEVELD_LEVEL27_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELD) Erase Flash Key  */
#define TAMPER_LEVELD_LEVEL27_NONE            (TAMPER_LEVELD_LEVEL27_NONE_Val << TAMPER_LEVELD_LEVEL27_Pos) /* (TAMPER_LEVELD) No Action Position  */
#define TAMPER_LEVELD_LEVEL27_HOSTIRQ         (TAMPER_LEVELD_LEVEL27_HOSTIRQ_Val << TAMPER_LEVELD_LEVEL27_Pos) /* (TAMPER_LEVELD) Host Interrupt Position  */
#define TAMPER_LEVELD_LEVEL27_LEHIRQ          (TAMPER_LEVELD_LEVEL27_LEHIRQ_Val << TAMPER_LEVELD_LEVEL27_Pos) /* (TAMPER_LEVELD) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELD_LEVEL27_SAFEMODE        (TAMPER_LEVELD_LEVEL27_SAFEMODE_Val << TAMPER_LEVELD_LEVEL27_Pos) /* (TAMPER_LEVELD) Enter Safe Mode Position  */
#define TAMPER_LEVELD_LEVEL27_ERSTKEY         (TAMPER_LEVELD_LEVEL27_ERSTKEY_Val << TAMPER_LEVELD_LEVEL27_Pos) /* (TAMPER_LEVELD) Erase Tamper Key Position  */
#define TAMPER_LEVELD_LEVEL27_ERSFKEY         (TAMPER_LEVELD_LEVEL27_ERSFKEY_Val << TAMPER_LEVELD_LEVEL27_Pos) /* (TAMPER_LEVELD) Erase Flash Key Position  */
#define TAMPER_LEVELD_LEVEL28_Pos             _UINT32_(16)                                         /* (TAMPER_LEVELD) Level 28 Position */
#define TAMPER_LEVELD_LEVEL28_Msk             (_UINT32_(0xF) << TAMPER_LEVELD_LEVEL28_Pos)         /* (TAMPER_LEVELD) Level 28 Mask */
#define TAMPER_LEVELD_LEVEL28(value)          (TAMPER_LEVELD_LEVEL28_Msk & (_UINT32_(value) << TAMPER_LEVELD_LEVEL28_Pos)) /* Assigment of value for LEVEL28 in the TAMPER_LEVELD register */
#define   TAMPER_LEVELD_LEVEL28_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELD) No Action  */
#define   TAMPER_LEVELD_LEVEL28_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELD) Host Interrupt  */
#define   TAMPER_LEVELD_LEVEL28_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELD) Log Event and Host Interrupt  */
#define   TAMPER_LEVELD_LEVEL28_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELD) Enter Safe Mode  */
#define   TAMPER_LEVELD_LEVEL28_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELD) Erase Tamper Key  */
#define   TAMPER_LEVELD_LEVEL28_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELD) Erase Flash Key  */
#define TAMPER_LEVELD_LEVEL28_NONE            (TAMPER_LEVELD_LEVEL28_NONE_Val << TAMPER_LEVELD_LEVEL28_Pos) /* (TAMPER_LEVELD) No Action Position  */
#define TAMPER_LEVELD_LEVEL28_HOSTIRQ         (TAMPER_LEVELD_LEVEL28_HOSTIRQ_Val << TAMPER_LEVELD_LEVEL28_Pos) /* (TAMPER_LEVELD) Host Interrupt Position  */
#define TAMPER_LEVELD_LEVEL28_LEHIRQ          (TAMPER_LEVELD_LEVEL28_LEHIRQ_Val << TAMPER_LEVELD_LEVEL28_Pos) /* (TAMPER_LEVELD) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELD_LEVEL28_SAFEMODE        (TAMPER_LEVELD_LEVEL28_SAFEMODE_Val << TAMPER_LEVELD_LEVEL28_Pos) /* (TAMPER_LEVELD) Enter Safe Mode Position  */
#define TAMPER_LEVELD_LEVEL28_ERSTKEY         (TAMPER_LEVELD_LEVEL28_ERSTKEY_Val << TAMPER_LEVELD_LEVEL28_Pos) /* (TAMPER_LEVELD) Erase Tamper Key Position  */
#define TAMPER_LEVELD_LEVEL28_ERSFKEY         (TAMPER_LEVELD_LEVEL28_ERSFKEY_Val << TAMPER_LEVELD_LEVEL28_Pos) /* (TAMPER_LEVELD) Erase Flash Key Position  */
#define TAMPER_LEVELD_LEVEL29_Pos             _UINT32_(20)                                         /* (TAMPER_LEVELD) Level 29 Position */
#define TAMPER_LEVELD_LEVEL29_Msk             (_UINT32_(0xF) << TAMPER_LEVELD_LEVEL29_Pos)         /* (TAMPER_LEVELD) Level 29 Mask */
#define TAMPER_LEVELD_LEVEL29(value)          (TAMPER_LEVELD_LEVEL29_Msk & (_UINT32_(value) << TAMPER_LEVELD_LEVEL29_Pos)) /* Assigment of value for LEVEL29 in the TAMPER_LEVELD register */
#define   TAMPER_LEVELD_LEVEL29_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELD) No Action  */
#define   TAMPER_LEVELD_LEVEL29_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELD) Host Interrupt  */
#define   TAMPER_LEVELD_LEVEL29_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELD) Log Event and Host Interrupt  */
#define   TAMPER_LEVELD_LEVEL29_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELD) Enter Safe Mode  */
#define   TAMPER_LEVELD_LEVEL29_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELD) Erase Tamper Key  */
#define   TAMPER_LEVELD_LEVEL29_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELD) Erase Flash Key  */
#define TAMPER_LEVELD_LEVEL29_NONE            (TAMPER_LEVELD_LEVEL29_NONE_Val << TAMPER_LEVELD_LEVEL29_Pos) /* (TAMPER_LEVELD) No Action Position  */
#define TAMPER_LEVELD_LEVEL29_HOSTIRQ         (TAMPER_LEVELD_LEVEL29_HOSTIRQ_Val << TAMPER_LEVELD_LEVEL29_Pos) /* (TAMPER_LEVELD) Host Interrupt Position  */
#define TAMPER_LEVELD_LEVEL29_LEHIRQ          (TAMPER_LEVELD_LEVEL29_LEHIRQ_Val << TAMPER_LEVELD_LEVEL29_Pos) /* (TAMPER_LEVELD) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELD_LEVEL29_SAFEMODE        (TAMPER_LEVELD_LEVEL29_SAFEMODE_Val << TAMPER_LEVELD_LEVEL29_Pos) /* (TAMPER_LEVELD) Enter Safe Mode Position  */
#define TAMPER_LEVELD_LEVEL29_ERSTKEY         (TAMPER_LEVELD_LEVEL29_ERSTKEY_Val << TAMPER_LEVELD_LEVEL29_Pos) /* (TAMPER_LEVELD) Erase Tamper Key Position  */
#define TAMPER_LEVELD_LEVEL29_ERSFKEY         (TAMPER_LEVELD_LEVEL29_ERSFKEY_Val << TAMPER_LEVELD_LEVEL29_Pos) /* (TAMPER_LEVELD) Erase Flash Key Position  */
#define TAMPER_LEVELD_LEVEL30_Pos             _UINT32_(24)                                         /* (TAMPER_LEVELD) Level 30 Position */
#define TAMPER_LEVELD_LEVEL30_Msk             (_UINT32_(0xF) << TAMPER_LEVELD_LEVEL30_Pos)         /* (TAMPER_LEVELD) Level 30 Mask */
#define TAMPER_LEVELD_LEVEL30(value)          (TAMPER_LEVELD_LEVEL30_Msk & (_UINT32_(value) << TAMPER_LEVELD_LEVEL30_Pos)) /* Assigment of value for LEVEL30 in the TAMPER_LEVELD register */
#define   TAMPER_LEVELD_LEVEL30_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELD) No Action  */
#define   TAMPER_LEVELD_LEVEL30_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELD) Host Interrupt  */
#define   TAMPER_LEVELD_LEVEL30_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELD) Log Event and Host Interrupt  */
#define   TAMPER_LEVELD_LEVEL30_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELD) Enter Safe Mode  */
#define   TAMPER_LEVELD_LEVEL30_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELD) Erase Tamper Key  */
#define   TAMPER_LEVELD_LEVEL30_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELD) Erase Flash Key  */
#define TAMPER_LEVELD_LEVEL30_NONE            (TAMPER_LEVELD_LEVEL30_NONE_Val << TAMPER_LEVELD_LEVEL30_Pos) /* (TAMPER_LEVELD) No Action Position  */
#define TAMPER_LEVELD_LEVEL30_HOSTIRQ         (TAMPER_LEVELD_LEVEL30_HOSTIRQ_Val << TAMPER_LEVELD_LEVEL30_Pos) /* (TAMPER_LEVELD) Host Interrupt Position  */
#define TAMPER_LEVELD_LEVEL30_LEHIRQ          (TAMPER_LEVELD_LEVEL30_LEHIRQ_Val << TAMPER_LEVELD_LEVEL30_Pos) /* (TAMPER_LEVELD) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELD_LEVEL30_SAFEMODE        (TAMPER_LEVELD_LEVEL30_SAFEMODE_Val << TAMPER_LEVELD_LEVEL30_Pos) /* (TAMPER_LEVELD) Enter Safe Mode Position  */
#define TAMPER_LEVELD_LEVEL30_ERSTKEY         (TAMPER_LEVELD_LEVEL30_ERSTKEY_Val << TAMPER_LEVELD_LEVEL30_Pos) /* (TAMPER_LEVELD) Erase Tamper Key Position  */
#define TAMPER_LEVELD_LEVEL30_ERSFKEY         (TAMPER_LEVELD_LEVEL30_ERSFKEY_Val << TAMPER_LEVELD_LEVEL30_Pos) /* (TAMPER_LEVELD) Erase Flash Key Position  */
#define TAMPER_LEVELD_LEVEL31_Pos             _UINT32_(28)                                         /* (TAMPER_LEVELD) Level 31 Position */
#define TAMPER_LEVELD_LEVEL31_Msk             (_UINT32_(0xF) << TAMPER_LEVELD_LEVEL31_Pos)         /* (TAMPER_LEVELD) Level 31 Mask */
#define TAMPER_LEVELD_LEVEL31(value)          (TAMPER_LEVELD_LEVEL31_Msk & (_UINT32_(value) << TAMPER_LEVELD_LEVEL31_Pos)) /* Assigment of value for LEVEL31 in the TAMPER_LEVELD register */
#define   TAMPER_LEVELD_LEVEL31_NONE_Val      _UINT32_(0x0)                                        /* (TAMPER_LEVELD) No Action  */
#define   TAMPER_LEVELD_LEVEL31_HOSTIRQ_Val   _UINT32_(0x1)                                        /* (TAMPER_LEVELD) Host Interrupt  */
#define   TAMPER_LEVELD_LEVEL31_LEHIRQ_Val    _UINT32_(0x2)                                        /* (TAMPER_LEVELD) Log Event and Host Interrupt  */
#define   TAMPER_LEVELD_LEVEL31_SAFEMODE_Val  _UINT32_(0x4)                                        /* (TAMPER_LEVELD) Enter Safe Mode  */
#define   TAMPER_LEVELD_LEVEL31_ERSTKEY_Val   _UINT32_(0x5)                                        /* (TAMPER_LEVELD) Erase Tamper Key  */
#define   TAMPER_LEVELD_LEVEL31_ERSFKEY_Val   _UINT32_(0x6)                                        /* (TAMPER_LEVELD) Erase Flash Key  */
#define TAMPER_LEVELD_LEVEL31_NONE            (TAMPER_LEVELD_LEVEL31_NONE_Val << TAMPER_LEVELD_LEVEL31_Pos) /* (TAMPER_LEVELD) No Action Position  */
#define TAMPER_LEVELD_LEVEL31_HOSTIRQ         (TAMPER_LEVELD_LEVEL31_HOSTIRQ_Val << TAMPER_LEVELD_LEVEL31_Pos) /* (TAMPER_LEVELD) Host Interrupt Position  */
#define TAMPER_LEVELD_LEVEL31_LEHIRQ          (TAMPER_LEVELD_LEVEL31_LEHIRQ_Val << TAMPER_LEVELD_LEVEL31_Pos) /* (TAMPER_LEVELD) Log Event and Host Interrupt Position  */
#define TAMPER_LEVELD_LEVEL31_SAFEMODE        (TAMPER_LEVELD_LEVEL31_SAFEMODE_Val << TAMPER_LEVELD_LEVEL31_Pos) /* (TAMPER_LEVELD) Enter Safe Mode Position  */
#define TAMPER_LEVELD_LEVEL31_ERSTKEY         (TAMPER_LEVELD_LEVEL31_ERSTKEY_Val << TAMPER_LEVELD_LEVEL31_Pos) /* (TAMPER_LEVELD) Erase Tamper Key Position  */
#define TAMPER_LEVELD_LEVEL31_ERSFKEY         (TAMPER_LEVELD_LEVEL31_ERSFKEY_Val << TAMPER_LEVELD_LEVEL31_Pos) /* (TAMPER_LEVELD) Erase Flash Key Position  */
#define TAMPER_LEVELD_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (TAMPER_LEVELD) Register Mask  */


/* -------- TAMPER_RAWSTAT : (TAMPER Offset: 0x1C) ( R/ 32) Raw Status -------- */
#define TAMPER_RAWSTAT_RESETVALUE             _UINT32_(0x00)                                       /*  (TAMPER_RAWSTAT) Raw Status  Reset Value */

#define TAMPER_RAWSTAT_Msk                    _UINT32_(0x00000000)                                 /* (TAMPER_RAWSTAT) Register Mask  */


/* -------- TAMPER_SETLEVEL : (TAMPER Offset: 0x10) ( /W 32) Set Level -------- */
#define TAMPER_SETLEVEL_RESETVALUE            _UINT32_(0x00)                                       /*  (TAMPER_SETLEVEL) Set Level  Reset Value */

#define TAMPER_SETLEVEL_TamperLevel_Pos       _UINT32_(0)                                          /* (TAMPER_SETLEVEL) Tamper Level Position */
#define TAMPER_SETLEVEL_TamperLevel_Msk       (_UINT32_(0x7) << TAMPER_SETLEVEL_TamperLevel_Pos)   /* (TAMPER_SETLEVEL) Tamper Level Mask */
#define TAMPER_SETLEVEL_TamperLevel(value)    (TAMPER_SETLEVEL_TamperLevel_Msk & (_UINT32_(value) << TAMPER_SETLEVEL_TamperLevel_Pos)) /* Assigment of value for TamperLevel in the TAMPER_SETLEVEL register */
#define TAMPER_SETLEVEL_TamperID_Pos          _UINT32_(8)                                          /* (TAMPER_SETLEVEL) Tamper ID Position */
#define TAMPER_SETLEVEL_TamperID_Msk          (_UINT32_(0x1F) << TAMPER_SETLEVEL_TamperID_Pos)     /* (TAMPER_SETLEVEL) Tamper ID Mask */
#define TAMPER_SETLEVEL_TamperID(value)       (TAMPER_SETLEVEL_TamperID_Msk & (_UINT32_(value) << TAMPER_SETLEVEL_TamperID_Pos)) /* Assigment of value for TamperID in the TAMPER_SETLEVEL register */
#define TAMPER_SETLEVEL_ProtectionKey_Pos     _UINT32_(16)                                         /* (TAMPER_SETLEVEL) Protection Key Position */
#define TAMPER_SETLEVEL_ProtectionKey_Msk     (_UINT32_(0xFFFF) << TAMPER_SETLEVEL_ProtectionKey_Pos) /* (TAMPER_SETLEVEL) Protection Key Mask */
#define TAMPER_SETLEVEL_ProtectionKey(value)  (TAMPER_SETLEVEL_ProtectionKey_Msk & (_UINT32_(value) << TAMPER_SETLEVEL_ProtectionKey_Pos)) /* Assigment of value for ProtectionKey in the TAMPER_SETLEVEL register */
#define TAMPER_SETLEVEL_Msk                   _UINT32_(0xFFFF1F07)                                 /* (TAMPER_SETLEVEL) Register Mask  */


